# 49. Планеты вращаются вокруг звезд по эллиптическим орбитам.
# Назовем самой далекой планетой ту, орбита которой имеет самую
# большую площадь. Напишите функцию find_farthest_orbit(list_of_orbits),
# которая среди списка орбит планет найдет ту, по которой вращается самая
# далекая планета. Круговые орбиты не учитывайте: вы знаете, что у вашей
# звезды таких планет нет, зато искусственные спутники были были запущены
# на круговые орбиты. Результатом функции должен быть кортеж, содержащий
# длины полуосей эллипса орбиты самой далекой планеты. Каждая орбита
# представляет из себя кортеж из пары чисел - полуосей ее эллипса.
# Площадь эллипса вычисляется по формуле S = piab, где a и b - длины
# полуосей эллипса. При решении задачи используйте списочные выражения.
# Подсказка: проще всего будет найти эллипс в два шага: сначала вычислить
# самую большую площадь эллипса, а затем найти и сам эллипс, имеющий такую
# площадь. Гарантируется, что самая далекая планета ровно одна

import math


# def find_farthest_orbit(orbits):
#     max = 0
#     imax = 0
#     for i in range(len(orbits)):
#         if orbits[i][0] != orbits[i][1]:
#             S = math.pi * orbits[i][0] * orbits[i][1]
#             if S > max:
#                 max = S
#                 imax = i
#     return orbits[imax]


# # Ввод:

import math
orbits = [(1, 3), (2.5, 10), (7, 2), (6, 6), (4, 3)]

new = list(filter(lambda x: x[0] != x[1], orbits))
new2 = max(map(lambda x: x[0]*x[1]*math.pi, new))
print(new2)
print(list(filter(lambda x: x[0]*x[1]*math.pi == new2, new)))

print(max(list(map(lambda x: x[0] * x[1] * math.pi, filter(lambda x: x[0] != x[1], orbits)))))
