# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

a = input('Введите трехзначное число:')
num1 = int(a[0])
num2 = int(a[1])
num3 = int(a[2])
print(f'Сумма чисел :{num1 + num2 + num3}')

