# 17. Дан список чисел. Определите, сколько в нем встречается различных чисел.

numbers = [11, 22, 33, 44, 55, 11, 22, 33, 11, 1]
unique_numbers = set(numbers)
print(len(unique_numbers))
print(unique_numbers)
