# 2. Площадь
# Пользователь вводит стороны прямоугольника,
# выведите его площадь

a = int(input('Введите число 1:'))
b = int(input('Введите число 2:'))
s = 2 * (a + b)
print(f'Площадь треугольника: {s}')
