# 1. Меньшее из двух
# Пользователь вводит два целых числа. Выведите меньшее из них.

a = int(input())
b = int(input())
if a < b:
    print(a)
else:
    print(b)