# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#
# Пример:
#
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

list_1 = [2, 3, 4, 5, 6]
list_2 = []
count1 = 0
count2 = len(list_1) - 1  # 4
while count2 >= count1:
    multy = list_1[count1] * list_1[count2]
    list_2.append(multy)
    count1 += 1
    count2 -= 1
print(list_2)
