# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

num1 = int(input())
binary = ''
while num1 > 0:
    binary = f'{num1 % 2}{binary}'
    num1 = num1 // 2

print(binary)
